// Напишите программу, которая 
// на вход принимает число и
// выдает, является ли число четным (делится ли оно на два без остатка).
// 4 -> да
// -3 -> нет
// 7 -> нет

// if (a % 2 == 0)
// {
// Console.WriteLine("yes");
// }
// else
// {
// Console.WriteLine("no");
// }


if (3 % 2 == 0)
{
Console.WriteLine("yes");
}
else
{
Console.WriteLine("no");
}