// Напишите программу, которая 
// на вход принимает два числа и 
// выдает, какое число большее, а какое меньшее.
// a = 5; b = 7 -> max = 7
// a = 2; b = 10 -> max = 10
// a = -9; b = -3 -> max = -3

// int number_a = x;
// int number_b = y;
// if (number_a > number_b)
// Console.WriteLine(number_a);
// else if (number_b > number_a)
// Console.WriteLine(number_b);

int number_a = 2;
int number_b = 20;
if (number_a > number_b)
Console.WriteLine(number_a);
else if (number_b > number_a)
Console.WriteLine(number_b);